tema4.tex
% Created 2024-04-07 dom 22:24
% Intended LaTeX compiler: pdflatex
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\mode<beamer>{\usetheme{Madrid}}
\usetheme{default}
\author{Adrián Arroyo Calle}
\date{Curso 2023-2024}
\title{Memoria Compartida II}
\hypersetup{
 pdfauthor={Adrián Arroyo Calle},
 pdftitle={Memoria Compartida II},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle

\section{Memoria compartida II}
\label{sec:orgeab7d02}

\begin{frame}[label={sec:org2978592}]{Data race}
\begin{itemize}
\item En un sistema de memoria compartida, la memoria es única pero el procesamiento es independiente.
\item Es posible que varios procesadores intenten acceder a la vez al mismo punto de la memoria.
\item En este caso tenemos una situación de \alert{data race}.
\item Hay que evitar las data race, ya que los bugs que provocan comportan un grado de aleatoriedad elevado.
Es posible que en pruebas nunca ocurra nada incorrecto, pero en producción sí. Son difíciles de replicar, \emph{Heisenbug}.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org9305230}]{Atómicos}
\begin{itemize}
\item La manera más elemental de evitar data races es mediante el uso de \alert{atómicos}.
\item La data race ocurre cuando dos threads leen "a la vez", para posteriormente cada una hacer una modificación sobre el valor.
De este modo, uno escribirá correctamente, pero el segundo thread no tendrá en cuenta la escritura inmediatamente anterior
del primer thread, obteniendo un valor incorrecto.
\item Las operaciones atómicas garantizan que entre la lectura y el guardado en memoria del nuevo dato, no ha accedido ningún otro thread.
\item Los atómicos tienen que implementarse a nivel de hardware.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb85ccd3},fragile]{Atómicos en Julia}
 \begin{verbatim}
function s(a)
    c = 0.0
    for x in a
        c = c + x
    end
    c
end

function p(a)
    c = 0.0
    Threads.@threads for x in a
        c = c + x
    end
    c
end

a = rand(10000)
s(a) # 5005.2377...
s(a) # 5005.2377...
p(a) # 3774.5142...
p(a) # 1646.2098...
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org0971f9f},fragile]{Atómicos en Julia}
 \begin{verbatim}
function atomic_p(a)
    c = Threads.Atomic{Float64}(0.0)
    Threads.@threads for x in a
        Threads.atomic_add!(c, x)
    end
    c
end
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org2cb388c}]{Atómicos en Julia}
\begin{itemize}
\item Solo algunas operaciones se soportan de forma atómica.
\item Tenemos que usar variables de tipo atómico.
\item El resultado aun así puede variar ligeramente si el orden de las operaciones afecta (como en el caso de aritmética con floats).
\item Las operaciones con atómicos son más lentas.
\item En este caso podría haberse reordenado la paralelización para haber evitado usar atómicos.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4f47ab5}]{Atómicos como pieza}
\begin{itemize}
\item Usando atómicos como base se pueden implementar otras primitivas de sincronización.
\item Mutex, semáforos, condiciones, \ldots{}
\item Especialmente útiles cuando el algoritmo maneja datos \alert{heterogéneos}.
\item Una abstracción de alto nivel son los \alert{canales}.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4f6ff34},fragile]{Canales}
 \begin{itemize}
\item Sistema de comunicación entre threads.
\item Por un lado podemos enviar mensajes: \texttt{put!}
\item Por otro lado podemos recibir mensajes: \texttt{take!}
\item Es seguro compartir los canales entre threads.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org76c8b1a},fragile]{Canales}
 \begin{verbatim}
function suma(data_ch, sum_ch)
    c = 0.0
    a = take!(data_ch)
    for x in a
        c = c + x
    end
    put!(sum_ch, c)
end
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org7e7dcab},fragile]{Canales}
 \begin{verbatim}
function channel_example(a)
    data_ch = Channel(Threads.nthreads())
    sum_ch = Channel(Threads.nthreads())
    for i in 1:Threads.nthreads()
        Threads.@spawn suma(data_ch, sum_ch)
    end
    chunks = Iterators.partition(
        a, length(a) ÷ Threads.nthreads())
    for chunk in chunks
        put!(data_ch, chunk)
    end
    s = 0.0
    for i in 1:Threads.nthreads()
        s += take!(sum_ch)
    end
    s
end
\end{verbatim}
\end{frame}

\begin{frame}[label={sec:org23baeff}]{Async}
\begin{itemize}
\item Últimamente está surgiendo el concepto de programación \alert{asíncrona}.
\item El concepto fundamental es el \alert{futuro}. Las funciones en vez de devolver un valor, devuelven una promesa
de que en un futuro habrá un valor.
\item Los futuros se pueden pasar a otras funciones y hacer composiciones complejas pero \emph{sencillas} de entender.
\item El uso principal de la programación asíncrona es en situaciones donde el rendimiento se encuentra limitado
\alert{por I/O}, no por CPU.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga1c862b}]{Async}
\begin{itemize}
\item Tareas de I/O:
\begin{itemize}
\item Leer un fichero
\item Mandar datos a través de la red
\item Interactuar con una base de datos
\end{itemize}
\item Durante el tiempo que tarda en resolver la I/O, la CPU no hace nada. No somos eficientes.
\item Mediante futuros, podemos devolver inmediatamente un valor, sin hacer una espera.
\item Llegado el momento, el futuro se ejecutará. Cuando llegue una espera de I/O, el sistema empezará a ejecutar otro futuro, \alert{en el mismo thread}.
\item De ese modo la CPU no se queda esperando a tareas de I/O si puede seguir procesando futuros.
\item En algunos sistemas sí se puede delegar el futuro a un thread independiente, pero no es lo habitual.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org14b7d58},fragile]{Async en Julia}
 \begin{itemize}
\item En Julia los futuros son los \emph{Task}, que sirven tanto para multithreading como para programación asíncrona.
\item Si un task se crea con \texttt{Threads.@spawn} se ejecuta en un thread independiente.
\item Si un task se crea con \texttt{@async} se ejecuta en el thread que lo creó.
\item Podemos usar \texttt{@sync} sobre un bloque para sincronizar varios \texttt{@async}
\end{itemize}

\begin{verbatim}
@time @sync begin
  @async sleep(10)
  @async sleep(10)
end
\end{verbatim}
\end{frame}
\end{document}
